{
    "blog": [
        {
            "author": "Brandon W. Kipp",
            "date": "06/14/2016",
            "id": "5",
            "title": "SS Update",
            "text": [
                "So, I finally have a working color palette and a way to change waveform image color in SoundSword. My cousin, Tim,",
                "originally came up with the caching idea, and then I started storing them for faster recall when you reload the page.",
                "Then, I read a bunch about 'Composite Operations' which are a bunch of methods to add content onto already drawn canvases.",
                "Essentially, you just draw a rentangle the size of the canvas whose color you want to change, fill it with whatever color",
                "you want, and the composite operation applies the new canvas color only over the existing canvas lines and boom. It looks",
                "like you changed the color. There is a little bit of a glitch, it makes the canvas look a bit more blocky. I'm sure there is",
                "a way to fix it though."
            ]
        },
        {
            "author": "Brandon W. Kipp",
            "date": "06/9/2016",
            "id": "4",
            "title": "Based x 64",
            "text": [
                "TIL that Base64 exists and makes life easier sometimes. Base64, for those unfamiliar, is a type of encoding.",
                "So, the vast majority of humans do math in Base10; we've got 10 symbols (0-9), and all our numbers come from those 10",
                "symbols in differing combinations. Computers do math in Base2 with just 0's and 1's. Base64 uses uppercase A-Z, lowercase a-z,",
                "0-9, '+', and '/' which adds up to 64 different characters. Apparently, its first use was in email. Currently, I'm using it to",
                "cache HTML5 canvases in a web app. It works well and loads the images much faster than redrawing them every time the page loads.",
                "I originally made the mistake of storing the Base64 strings in a MySQL database, but have since learned that a better way to do it,",
                "is to store the cached images in a directory instead. The reason being is that I'm storing lots of cached images and to read them from",
                "the database can cause a serious strain on the network. In addition, I'm now trying to stored Base64 encoded audio files, which are way",
                "bigger than the images I'm already caching. However, I've sort of hit a stumbling block because the browser runs out of memory when I'm",
                "looping through the large ArrayBuffers and crashes (I'm doing this all in JavaScript). I've got a couple of ideas, but I'm not sure they",
                "will work. Will update later."
            ]
        },
        {
            "author": "Brandon W. Kipp",
            "date": "06/7/2016",
            "id": "3",
            "title": "Tomato Plant",
            "text": [
                "My girlfriend brought home a Cherry Tomato plant today from a local church. It's pretty small, but I'm excited to see",
                "how big it gets. I've got this UV grow light that only emits the relevant wavelengths required to grow plants. It's sort",
                "of pink. I like plants; I'm pretty fascinated with botany and how their nature relates to us and even how the future of",
                "plants will look. There was an article I read that talked about a group of lab scientists who were able to get a tree to",
                "pull up links of wire through their Xylem (kinda like veins, but for moving water). When water hit these specially made",
                "links, they stuck together and the wire that formed was able to conduct electricity. What does that mean for the future?",
                "Maybe if trees are able to transmit WiFi, we'll stop cutting them down. MAybe they'll evolve their own version of an",
                "antenna. That would be remarkable."
            ]
        },
        {
            "author": "Brandon W. Kipp",
            "date": "06/6/2016",
            "id": "2",
            "title": "Colors",
            "text": [
                "Today, I'm updating the color scheme on my website. I've never really researched color theory before today,",
                "but there is quite a bit of information on the internet. I read a couple blogs and was vaguely reminded of",
                "Art class in high school, but I didn't really pay attention back then. Anyway, I found this rad tool at",
                "https://color.adobe.com where you can pick these color templates based on dividing the color wheel in",
                "intuitive ways. The old color scheme I was using was terrible, but I had no idea how to pick good colors.",
                "It has got me thinking about the way things are packaged, and how satisfying a simple color scheme is. I'm",
                "sure I'm more likely to buy a product if its color scheme is pleasing to me."
            ]
        },
        {
            "author": "Brandon W. Kipp",
            "date": "06/5/2016",
            "id": "1",
            "title": "Settled In",
            "text": [
                "Everything is in its place, and every place has its thing. The last thing I want to do is to spend my entire life",
                "organizing my life. How much originization is really necessary? Enough to put your mind at ease. You can change how much",
                "you let it affect you. You change your response. These walls aren't your home. No walls could ever enclose what you call home.",
                "Life knows no bounds. It cannot be contained. Plants can erode through our best attempts at strength. Plants can hide our strength.",
                "How weird it must be to be an architect. An architect's art is no less permanent than a painting. You can make prints of paintings.",
                "You can make replicas of buildings. The experience can not be felt. Only artists feel art. Only artists experience art. Replication",
                "puts us one infinitely long degree away from art. So, what then are we experiencing when we experience a replication?"
            ]
        },
        {
            "author": "Brandon W. Kipp",
            "date": "06/3/2016",
            "id": "0",
            "title": "First Blog Ever",
            "text": [
                "So, I guess this is my first blog entry on this site. Today, I moved to Minneapolis all the way from",
                "Wisconsin with the intention of finding a new trail to blaze. For the past five years, I've been running",
                "a tiny recording studio. So many good things had come from that; I met so many creative and talented people.",
                "I got paid to do something I loved. Most importantly, I learned a lot about who I am. Like, that I happen to",
                "love business and finance. Never knew."
            ]
        }
    ]
}
